HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxIom_regdef.h
/** \\brief  IOM Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_KRSTCLR_Bits B;
} Ifx_IOM_KRSTCLR;

/** \\brief  IOM Logic Analyzer Module Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_LAMCFG_Bits B;
} Ifx_IOM_LAMCFG;

/** \\brief  IOM Logic Analyzer Module Event Window Count Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_LAMEWC_Bits B;
} Ifx_IOM_LAMEWC;

/** \\brief  IOM Logic Analyzer Module Event Window Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_LAMEWS_Bits B;
} Ifx_IOM_LAMEWS;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Iom_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  IOM object */
typedef volatile struct _Ifx_IOM
{
    Ifx_IOM_CLC CLC;                        /**< \brief 0, IOM Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_IOM_ID ID;                          /**< \brief 8, IOM Identification Register */
    unsigned char reserved_C[16];           /**< \brief C, \internal Reserved */
    Ifx_IOM_KRSTCLR KRSTCLR;                /**< \brief 1C, IOM Kernel Reset Status Clear Register */
    Ifx_IOM_KRST1 KRST1;                    /**< \brief 20, IOM Kernel Reset Register 1 */
    Ifx_IOM_KRST0 KRST0;                    /**< \brief 24, IOM Kernel Reset Register 0 */
    Ifx_IOM_ACCEN1 ACCEN1;                  /**< \brief 28, IOM Access Enable Register 1 */
    Ifx_IOM_ACCEN0 ACCEN0;                  /**< \brief 2C, IOM Access Enable Register 0 */
    Ifx_IOM_ECMCCFG ECMCCFG;                /**< \brief 30, IOM Event Combiner Module Counter Configuration Register */
    Ifx_IOM_ECMSELR ECMSELR;                /**< \brief 34, IOM Event Combiner Module Global Event Selection Register */
    Ifx_IOM_ECMETH0 ECMETH0;                /**< \brief 38, IOM Event Combiner Module Event Trigger History Register 0 */
    Ifx_IOM_ECMETH1 ECMETH1;                /**< \brief 3C, IOM Event Combiner Module Event Trigger History Register 1 */
    Ifx_IOM_GTMEXR GTMEXR;                  /**< \brief 40, IOM GTM Input EXOR Combiner Selection Register */
    unsigned char reserved_44[52];          /**< \brief 44, \internal Reserved */
    Ifx_IOM_FPCESR FPCESR;                  /**< \brief 78, IOM Filter and Prescaler Cells Rising & Falling Edge Status Register */
    unsigned char reserved_7C[4];           /**< \brief 7C, \internal Reserved */
    Ifx_IOM_FPCCTR FPCCTR[16];              /**< \brief 80, IOM Filter and Prescaler Cell Control Register */
    Ifx_IOM_FPCTIM FPCTIM[16];              /**< \brief C0, IOM Filter and Prescaler Cell Timer Register k */
    Ifx_IOM_LAMEWC LAMEWC[16];              /**< \brief 100, IOM Logic Analyzer Module Event Window Count Status Register */
    unsigned char reserved_140[64];         /**< \brief 140, \internal Reserved */
    Ifx_IOM_LAMCFG LAMCFG[16];              /**< \brief 180, IOM Logic Analyzer Module Configuration Register */
    Ifx_IOM_LAMEWS LAMEWS[16];              /**< \brief 1C0, IOM Logic Analyzer Module Event Window Configuration Register */
} Ifx_IOM;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXIOM_REGDEF_H */
